Extensions/src/InformationRegisters/AzRyНапоминанияПользователя/AzRyНапоминанияПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="281804bc-92a6-4ecf-ba3e-f9df86d13e5e">
  <name>AzRyНапоминанияПользователя</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="48f9c20c-db20-4a73-a582-4b75a82d55a1">
    <name>ВремяСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="08fd23e5-214e-40fd-81af-f737e3b8664c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7106a8fd-cbff-4d1a-a0d1-d6aa54d0d224">
    <name>Автор2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="f995cf7c-8fc1-497a-a9e7-a5c95f9e651d">
    <name>СтатусНапоминания</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="23b30069-f9fc-4c3d-87cd-c7476d84b401">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3a4d81cc-ca0e-4435-acfa-28eb8a442652">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e8f11a95-508b-47a2-a724-b27e3fa194c4">
    <name>Источник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/CommonModules/AzRyОбсужденияВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры работы с обсуждениями (вызов сервера)
//
////////////////////////////////////////////////////////////////////////////////


// Выполняет запрос по напоминаниям для текущего пользователя на момент времени ТекущаяДатаСеанса() + 30минут.
// Момент времени смещен от текущего для использования функции из модуля с повторным использованием
// возвращаемых значений.
// При обработке результата выполнения функции необходимо учитывать эту особенность.
//
// Параметры:
//	Нет
//
// Возвращаемое значение
//  Массив - таблица значений, сконвертированная в массив из структур, содержащих данные строк таблицы.
Функция ПолучитьОбсужденияТекущегоПользователя(ИнтервалПроверкиНапоминаний=1) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Напоминания.СтатусНапоминания КАК СтатусНапоминания,
	|	Напоминания.Получатель КАК Получатель,
	|	Напоминания.Отправитель КАК Отправитель,
	|	Напоминания.Автор2 КАК Автор2,
	|	Напоминания.Источник КАК Источник,
	|	Напоминания.ВремяСобытия КАК ВремяСобытия,
	|	Напоминания.Комментарий КАК Комментарий,
	|	Напоминания.ПредставлениеИсточника КАК ПредставлениеИсточника
	|ИЗ
	|	РегистрСведений.AzRyНапоминанияПользователя КАК Напоминания
	|ГДЕ
	|	Напоминания.Получатель = &Получатель
	|	И Напоминания.СтатусНапоминания <> &СтатусНапоминания
	|
	|УПОРЯДОЧИТЬ ПО
	|	Напоминания.ВремяСобытия";
	
	//Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса()+60*ИнтервалПроверкиНапоминаний);
	Запрос.УстановитьПараметр("Получатель", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("СтатусНапоминания", Перечисления.AzRyСтатусНапоминания.Finnished);
	
	Результат = НапоминанияПользователяСлужебный.ПолучитьМассивСтруктурИзТаблицы(Запрос.Выполнить().Выгрузить());
	
	Возврат Результат;
	
КонецФункции
